---
kind: other
id: Properties.T:Autodesk.Revit.DB.TextNoteType
source: html/e34d45a2-e184-8d59-8c02-5bdc1421433b.htm
---
# TextNoteType Properties

The id of the assembly instance to which the element belongs.